# coding=utf-8

"""
78. 5分割交差検定
76-77の実験では，学習に用いた事例を評価にも用いたため，正当な評価とは言えない．すなわち，分類器が訓練事例を丸暗記する際の性能を評価しており，モデルの汎化性能を測定していない．そこで，5分割交差検定により，極性分類の正解率，適合率，再現率，F1スコアを求めよ．
"""

# ベースライン
"""
$ classias-train -tb -g5 -x baseline.txt
...
===== Cross validation (1/5) =====
Accuracy: 0.7379 (1574/2133)
Micro P, R, F1: 0.7502 (799/1065), 0.7317 (799/1092), 0.7408
===== Cross validation (2/5) =====
Accuracy: 0.7670 (1636/2133)
Micro P, R, F1: 0.7644 (808/1057), 0.7652 (808/1056), 0.7648
===== Cross validation (3/5) =====
Accuracy: 0.7664 (1634/2132)
Micro P, R, F1: 0.7682 (802/1044), 0.7580 (802/1058), 0.7631
===== Cross validation (4/5) =====
Accuracy: 0.7598 (1620/2132)
Micro P, R, F1: 0.7412 (779/1051), 0.7645 (779/1019), 0.7527
===== Cross validation (5/5) =====
Accuracy: 0.7425 (1583/2132)
Micro P, R, F1: 0.7581 (818/1079), 0.7396 (818/1106), 0.7487
"""
# ここらから求めましょう

# 全素性（ベースライン + 2-gram）
"""
$ classias-train -tb -g5 -x train.txt
===== Cross validation (1/5) =====
Accuracy: 0.7426 (1584/2133)
Micro P, R, F1: 0.7588 (796/1049), 0.7289 (796/1092), 0.7436
===== Cross validation (2/5) =====
Accuracy: 0.7778 (1659/2133)
Micro P, R, F1: 0.7761 (818/1054), 0.7746 (818/1056), 0.7754
===== Cross validation (3/5) =====
Accuracy: 0.7749 (1652/2132)
Micro P, R, F1: 0.7790 (807/1036), 0.7628 (807/1058), 0.7708
===== Cross validation (4/5) =====
Accuracy: 0.7735 (1649/2132)
Micro P, R, F1: 0.7514 (801/1066), 0.7861 (801/1019), 0.7683
===== Cross validation (5/5) =====
Accuracy: 0.7481 (1595/2132)
Micro P, R, F1: 0.7637 (824/1079), 0.7450 (824/1106), 0.7542
"""
# ここらから求めましょう
